Repository: seanpm2001/mt-training-data
Catalog: nso/nso_pontoon.tmx
Source language: en_us
Languages: nso

source: The multi-language version of the Common Voice dataset is currently undergoing community supported bundling and cleaning. If you would like to help us bring Common Voice to new languages, go check out the <sentenceCollectorLink>Sentence Collection Tool</sentenceCollectorLink> for adding new sentences to the dataset, and Mozilla <pontoonLink>Pontoon</pontoonLink> for translating the website itself. New languages are added to Common Voice for voice contribution when 5000 approved sentences have been collected.
nso: Mohuta wa maleme a mantši dathasete ya Common Voice e dutše e tšwelapele go hlakana le go hlwekiša. Ge e ba o rata go re thuša go tliša Common Voice malemeng a ma mpsha, eya o lebelela <sentenceCollectorLink>Sedirišwa sa go Kgobokanetša Mafoko</sentenceCollectorLink> bakeng sa go oketša mafoko a ma mpsha go dathasete le Mozilla <pontoonLink>Pontoon</pontoonLink> bakeng sa go fetolela wepesaete ya bosona. Dipolelo tše mpsha di tsenywa go Common Voice bakeng sa tlaleletšo ya lentšu ga go se go kgoboketšego mafoko a amogetšwego a 5000.

source: The number of recordings and which languages you contribute to will be public.
nso: Palo ya dipego le dipolelo tšeo o di neetšego di tla phatlalatšwa.

source: The process by which a contributor’s profile information is obscured from their donated voice clips when packaged for download as a part of the dataset.
nso: Nakong yeo ba tshedimošo ya profaele ya moneedi e širwa ke dipego tša go neealwa ge di phuthetšwe go tanelouto ka ge di le karolo ya datha-set.

source: There are a lot of public organizations that might want to collaborate and already have a lot of texts they can donate as public domain. Reach out to local universities, Governments and open source organizations to talk about the project and ask for their help.
nso: Go na le mekgatlo e mentši ya setšhaba e ka nyakago go šomišana gomme e šetše e na le ditemana tše dintši tšeo ba ka neelago ka tšona go etša go lefelong la batho bohle. Ikgokaganye le diyunibesithi tša lefelong leo, Mebušo le mekgatlo e bulegilego go bolela ka morero le go kgopela thušo ya bona.

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
nso: Go na le ditsela tše dintši tše o ka naganago ka polelo. Ka morero wa mehlala wa tlhathollo ya mantšu, Common Voice e bontšha maikutlo tlhokomelo go ‘kwešišano ya bohlale’, goba ‘na diboledi tša dipolelo tše ba ka kwešišanago gantši ge ba ka leka go dira bjalo?’.

source: The recording was too long.
nso: Pego e be e le etelele kudu.

source: The recording was too quiet.
nso: Pego e be e homotše kudu.

source: The recording was too short.
nso: Pego e be e fokotšegile kudu.

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
nso: Go tla ba le phaphano ya tlhago ya modumo magareng ga babadi. Gana feela ge e ba modumo o le godimo kudu moo rekhotilwego e sa kwale botse, goba (seo se tlwaelegilego kudu) ge e ba e le tlase moo e sa kwale gore go boletšwe eng ka ntle le go lebelela mo go ngwadilego.

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
nso: Maleme a gona bjale a ka tlase ga tšwelopele ya setšhaba. <localizationGlossaryLink>wepesaeteng ya kgauswi</localizationGlossaryLink> le <sentenceCollectionGlossaryLink> kgoboketšo ya mantšu</sentenceCollectionGlossaryLink> e nyakega go thoma.

source: The selected file is too large
nso: Faele e kgethilweng e kgolo kudu

source: The Sentence Collector is part of <commonVoiceLink>Common Voice</commonVoiceLink>. It allows contributors to collect and validate sentences created by the community. You can use this tool also to import and clean-up small-to-medium-sized public domain corpus you have found or collected. All sentences need to be Public Domain. Approved sentences are exported every week to the Common Voice repository and are released on the Common Voice website on every new deployment.
nso: Molekgetho wa Mafoko ke karolo ya<commonVoiceLink> Common Voice</commonVoiceLink>. E dumelela gore baneedi go kgoboketša le go netefatša mafoko a hlangwego ke setšhaba. O ka šomiša sedirišwa se go tsenya le go hlwekiša sehlopha sa setšhaba se senyenyane go iša bogareng bja seo se hwetšalago goba o se kgoboketšego. Mafoko ka moka di swanetše go ba Lefelong la Setšhaba. Mafoko ao a amogetšwego a romelwa beke e nngwe le e nngwe polokelong ya Common Voice gomme di lokolwa wepesaeteng ya Common Voice ga go romelwa selo sengwe le se sengwe se sefsa.

source: The sentence has a grammatical or spelling error.
nso: Lefoko le nale phošo ya popopolelo le ya go peletwa.

source: The sentence has disrespectful or offensive language.
nso: Lefoko le nale mantšu a hlokago hlompho goba a kgopišago.

source: The sentence must be grammatically correct.
nso: Lefoko le swanetše go nepagala ka popopolelo.

source: The sentence must be speakable.
nso: Lefoko le swanetše gore le kgone go bolelwa.

source: The sentence must be spelled correctly.
nso: Lefoko le swanetše go ngwalwa ka nepo.

source: The site is ready to be launched when it reaches 75% completion.
nso: Saete e loketše go thomiša ge e fihla pheletšong ya 75%.

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
nso: Saete e tla thekgwa kapejana ka mo go ka kgonegago. Bakeng sa tsebišo ya morago-rago bjale, ka kgopelo ikgokaganye le <matrixLink>poledišano ya setšhaba ya Matrix</matrixLink> goba etela <githubLink>GitHub</githubLink> goba <discourseLink>diforamo tša rena tša Discourse</discourseLink> go romela le go šetša tokollo ya boiphihlelo bja saete.

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
nso: TE-LIUM coepus e dirilwe go odio tša go bolela le direkhoto tša yona di gona go wepesaete ya TEB.

source: The website text is translated into that language.
nso: Mengwalo ya wepesaete e fetoletšwe ka polelo yeo.

source: This is approximately the number of hours required to train a production speech-to-text system.
nso: Tše ke dinomoro tša diiri tše hlokalago go ruta tšweletšo ya lenaneo la sefetošetšadigwalwa mantšung.

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
nso: Se ke karolo e hlohloletšwago ke seripa sa go ba le datha go matlafatša temogo ya dinomoro tše bolelwago le go bonwa ga ee/aowa.

source: This is our process for translating and adapting our content for many locales (languages).
nso: Ye ke tiragalo ya rena ya go fetola le go itumelelanya le diteng tša rena tša bontši bja (dipolelo) tša kgauswi.

source: This page gives you an overview of all your submitted sentences. You may also delete already submitted sentences if needed, by marking the checkbox next to it and clicking on &quot;Delete selected sentences&quot; at the bottom. Please only remove sentences if absolutely necessary, for example if you noticed after the fact that a sentence is copyright protected.
nso: Letlakaleng le le go nea kakaretšo ya mafoko ka moka ao o wa rometšego. Gape o ka phumola tšeo se šetšego di rometšwe ge e ba go nhlokagala, ka go swaya lepokisana la kgauswi le yona ke moka o tobetsa; Phumola mafoko a kgethilwego; ka tlase. Ka kgopelo tloša mafoko ge feela go hlokagala, ka mohlala ge e ba o hlokometše ka morago ga tiragalo gore lefoko le šireleditšwe ke ditokelo tša molao.

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
nso: Peakanyo ye e laola ke ponagalo ya kelo ya baetapele. Ge e fihlilwe, tšwelopele ya gago e tla ba sephiring. Se se bolela gore seswantšho sa gago, leina le tšwelopele di ka se bonagale godimo ga kelo ya baetapele. Hlokomela gore mpshafatšo ya kelo ya baetapele itšea ~{ $minutes }metsotso go hlagiša diphetogo.

source: Three to go!
nso: Go setše tše tharo!

source: Tigre
nso: Se-Tigre

source: Tigrinya
nso: Se-Tigrinya

source: Today
nso: Lehono

source: Today's Common Voice progress on clips recorded
nso: Tšwelopele ya lehono ya Common Voice ya di pego tše di gatišitšwego

source: Today's Common Voice progress on clips validated
nso: Tšwelopele ya lehono ya Common Voice ya di pego di kgonthašitšwe

source: Today's Progress
nso: Tšwelopele ya Lehono

source: Toki Pona
nso: Se-Toki Pona

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
nso: Go e dira gore e tsene go dathasete ya Common Voice, pego ya lentšu e swanetše go netefatšwa ke bašomiši ba babedi ba go fapana.

source: To make the Common Voice dataset as useful as possible we have decided to only allow source text that is available under a Creative Commons (CC0) license. Using the CC0 standard means its more difficult to find and collect source text, but allows anyone to use the resulting voice data without usage restrictions or authorization from Mozilla. Ultimately, we want to make the multi-language dataset as useful as possible to everyone, including researchers, universities, startups, governments, social purpose organizations, and hobbyists.
nso: Go dira gore dathasete ya Common Voice e be molemo ka moo go ka kgonegago, re tšere sephetho sa go dumelela mothopo wa mogwalo feela go hwetšagala ka tlase ga laesense ya Creative Commons (CC0). Go šomiša maemo a CC0 go bolela gore go boima kudu go hwetša le go kgoboketša mothopo wa mogwalo, eupša go dumelela mang le mang go šomiša dintlha tša lentšu ka ntle ga dithibelo tša ditirišo goba tumelelo go tšwa go Mozilla. Mafelelong, re nyaka go dira gore dathasete ya maleme a mantši/polelo e ntši e be molemo ka moo go ka kgonegago go motho yo mongwe le yo mongwe, go akaretša banyakišiši, diyunibesithi, ba thomago, mebušo, mekgatlo ya merero ya setšhaba, le batho ba ratago go itloša bodutu.

source: Top Contributors
nso: Baneedi ba Phagamego

source: Total
nso: Palo-moka

source: Total Approved
nso: Palo-moka e Amogetšwego

source: { $totalHours } hours is achievable in just over { $periodMonths } months if { $people } people record { $clipsPerDay } clips a day.
nso: { $totalHours } diiri di ya fihlelelwa ka godimo ga { $periodMonths } dikgwedi ge e ba { $people } batho o rekhota { $clipsPerDay } dipego ka letšatši.

source: { $totalInReview } sentences in review.
nso: { $totalInReview } mafoko a hlahlobjago.

source: { $totalSentences } total sentences.
nso: { $totalSentences } palo-moka ya mafoko.

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
nso: Ka la letona re hlalosa mehola le go tlhaolla gore na ke tshedimošo efe e re phatlalatšago. Diriša kgokagano tša ka tlase go thoma ka akhaonte ya Common Voice go sedirišwa sa gago.

source: Toward next goal
nso: Go yela go pakane e latelago!

source: Track progress here and on your stats page.
nso: Latela tšwelopele mo le letlakaleng la gago la dipalo-palo.

source: Translate this page
nso: Fetolela letlakala le la wepsaete

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
nso: <translateVideoLink>Lebela ditaetši go tseba go šomiša Pontoon.</translateVideoLink>

source: Translating the site
nso: Go fetolela saete

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
nso: Phetolelo e tšwa go Seisemane, eupša o ka bona <strong>Ditšhišinyo</strong> ka dipolelong tše dingwe. Tobetsa <strong>aekhone ya Profaele</strong> aekhone, ke moka <strong>Selaelatirišo</strong> linke yaebe o tsenya dipolelo tšeo o di bolelago. Ka tlase ga sona ka letsogong le letona go tla ba le lenaneo la diphetolelo e bitšwago <strong>Locales</strong>. Diphetolelo di bontšha saeteng ka morago ga letšatši letee.

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
nso: Go fetola ga saete ya Common Voice e diragala go <strong>Pontoon</strong>.

source: Tshivenda
nso: Se-Venda

source: Turkish
nso: Se-Turkish

source: Turkmen
nso: Se-Turkmen

source: Twi
nso: Se-Twi

source: Typically megabytes
nso: Megabytes e tlwaelegilego

source: Ubykh
nso: Se-Ubykh

source: Udmurt
nso: Se-Udmurt

source: Ukrainian
nso: Se-Ukrainia

source: Understand contribution criteria
nso: Kwešiša kriteria ya go tlaleletša

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
nso: Kwešiša gore ke eng se o swanetše go se lebelela ge o theeletša dipego gomme o thutše go dira direkhoto tša gago tša lentšu di hume!

source: Unexpected response returned from server
nso: Karabo yeo bego e sa letelwa e bušetšwe go seba

source: Unfortunately we can’t have Wikimedia articles yet. So do not copy paste from there.
nso: Ka bomadimabe re ka se kgone go ba le di athekele tša Wikimedia gabjale. O se ke kopiša wa ba wa mometše e tšwago moo.

source: { $unreviewedSentencesByYou } sentences left for you to review.
nso: { $unreviewedSentencesByYou } mafoko a šetšego a gore o wa tlhahlobe.

source: Updating…
nso: E ya mpshafatšwa...

source: Upload aborted. Do you want to delete your recordings?
nso: Go tsenya ga faele go ganne. O nyaka go phumola di pego tša gago?

source: Upload an image file
nso: Tsenya faele ya senepe netwekeng.

source: Urdu
nso: Se-Urdu

source: User Name
nso: Leina la Mošomiši

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
nso: Bašomiši ba kgonthiša go nepagala ga dipego tše ba di neetšego, ba lebelela gore moboledi o bala mafoko gabotse.

source: Using Common Voice
nso: Go Berekiša Common Voice

source: Uyghur
nso: Se-Uyghur

source: Uzbek
nso: Se-Uzbek

source: Validated Clips
nso: Dipego tše di Kgonthišitšwego

source: Validated Hours
nso: Diiri tše Kgonthišitšwego

source: Validated Hr. Total
nso: Palo- moka ya diiri tše kgonthišetšwego

source: { $validatedSentences } validated sentences.
nso: { $validatedSentences } mafoko a kgonthašitšwego.

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
nso: Go netefatša dikarolwana tše neelwego ke mokgwa o bohlokwa kudu mo go Common Voice. Theeletša gomme o re thuše go hlangwa datha ya mothopo o bulegilego wa lentšu.

source: Validation Progress
nso: Kgonthišišo ya Tšwelopele

source: Validations
nso: Dikgonthišišo

source: Value and recognition.
nso: Boleng le temogo.

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
nso: Mehuta e fapa-fapanego ke mohuta o itseng wa polelo – ka mohlala hlakanetšwego ke bao ba phelago tikologong goba setšhabeng. Ka dinako tše dingwe di bitšwa mebolelo.

source: Varying Pronunciations
nso: Dipiletšo tša Mantšu tše Fapanego

source: Venetian
nso: Se-Venetian

source: Version
nso: Bešene

source: Vietnamese
nso: Se-Vietnamese

source: View your progress against personal and project goals.
nso: Lebelela tšwelopele ya gago o e lebantše le di pakane tša gago le tša projeke.

source: Visible
nso: Bonagala

source: Voice clips are entered into a submission queue that readies them for listening.
nso: Dipego tša lentšu di tsenywa ka gare ga lenaneotetelo le di lokišwago go theeletšwa.

source: Voice Contribution
nso: Go Neela ka Lentšu

source: Voice Dataset, Ready for Download
nso: Dathasete ya lentšu, e Loketše go Taneloutwa

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
nso: Lentšu ke la tlhago, lentšu ke motho. Ke ka baka leo re kgahlišago ke go hlangwa theknolotši ya lentšu e dirišwago bakeng sa metšhene ya rena. Eupša go hlangwa thulaganyo ya lentšu, bahlagiši ba hloka palo e kgolo ya datha ya lentšu.

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
nso: Lentšu ke la tlhago, lentšu ke motho. Ke ka le baka leo re kgahlišago ke go hlangwa theknolotši ya lentšu e dirišwago bakeng sa metšhini ya rena. Eupša go hlangwa tshepidišo ya lentšu, go hlokagala palo e kgolo ya datha ya lentšu.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Common Voice is part of Mozilla’s initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language.
nso: Theknolotši ya go tlhatholla lentšu e fetola tselayeo re dirišanago le metšhene ka gona, eupša ditshepedišo tšeo di be go gona nakong ye di bitša tšhelete e ntši ebile ke tša batho. Common Voice ke karolo ya magato a boikitlaetšo ba Mozilla ba go dira gore mahlale a go tlhatholla lentšu a be kaone le gore a hwetšagale ke motho yo mongwe le yo mongwe. Common Voice ke dathabeise ya lefase ka bophara ya mantšu a neetšwego e dumela mang goba mang gore a kwetletše ka pejana le ga bonolo didirišwa tše nago le lentšu ka polelo ye nngwe le ye nngwe.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Mozilla Common Voice is an initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language. We're not only collecting voice samples in widely spoken languages but also in those with a smaller population of speakers. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and communities to address this gap themselves.
nso: Theknolotši ya go tlhatholla lentšu e fetola tselayeo re dirišanago le metšhene ka gona, eupša ditshepedišo tšeo di be go gona nakong ye di bitša tšhelete e ntši ebile ke tša batho. Common Voice ke karolo ya magato a boikitlaetšo ba Mozilla ba go dira gore mahlale a go tlhatholla lentšu a be kaone le gore a hwetšagale ke motho yo mongwe le yo mongwe. Common Voice ke dathabeise ya lefase ka bophara ya mantšu a neetšwego e dumela mang goba mang gore a kwetletše ka pejana le ga bonolo didirišwa tše nago le lentšu ka polelo ye nngwe le ye nngwe.

source: Voices Online Now
nso: Mantšu a Inthaneteng ga Bjale

source: Voice Validation
nso: Kgonthišišo ya Lentšu

source: Volume
nso: Bolumo

source: Votic
nso: Se-Votic

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
nso: VoxForge e beilwe go kgobokanya polelo e fetotšwego gore e berikišwe ka Mahala le Mothopo o Bulegilego wa Di-entšene tša Tlhathollo ya Polelo.

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
nso: O nyaka go thuša go dira Common Voice gore e be kaone? Seo se a kgahliša! Ikgokaganye ka e-meile goba <discourseLink>Discourse </discourseLink>diforamo, romela ditokollo tša saete go <githubLink>GitHub</githubLink>, goba ikgokaganye le <matrixLink>poledišano ya setšhaba ya Matrix<matrixLink>.

source: Want to stay in touch with Common Voice?
nso: O nyaka go dula o boledišana le Common Voice?

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
nso: O nyaka di mpshafatšo ge re lokolla di bešene tše mpsha tša dathasete ya Common Voice? Ngwadiša go lengwalo la rena la ditaba.

source: Watch our video explainer to help
nso: Lebelela vidio ya rena e tlalosang go go thuša

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
nso: Re aga tatelano ya dathasete ya lentšu e bulegilego le go phatlalatšwa gore batho ka moka ba ka e berikšago go tlwaetša ditirišo tša go dumela polelo.

source: We are going out to get a coffee.
nso: Re ya tšwa go hwetša kofi.

source: We are going out to get coffee.
nso: Re ilo go hwetša kofi.

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
nso: Rena ba Mozilla re aga setšhaba mabapi le theknolotši ya lentšu. Re lakatša go dula re ikgokagantše le diphetogo, methopo e mpsha ya datha le go kwa ka mo go oketšegilego ka mokgwa wa go diriša datha tšeo.

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
nso: Re dumela gore dathasete tša lentšu tše dikgolo di tla hwetšagala phatlalatša di kgothaletša go tšweletša mekgwa e mefsa le tlhodišano ya kgwebo e matla go theknolotši ya go mantšu e thekgilwego ke motšhene. Se ke boiteko ba lefase ka moka gomme re mema motho yo mongwe le yo mongwe go tšea karoko. Boikemišetšo bja rena ke go thuša theknolotši le poledišano gore e tsentšhwe batho ka moka, e bonagatše mehuta e fapa-fapanego ya mantšu a tšwago lefaseng ka bophara.

source: We believe that large, publicly available voice datasets will foster innovation and healthy commercial competition in machine-learning based speech technology. Common Voice’s multi-language dataset is already the largest publicly available voice dataset of its kind, but it’s not the only one. Look to this page as a reference hub for other open source voice datasets and, as Common Voice continues to grow, a home for our release updates.
nso: Re dumela gore dathasete tša lentšu tše dikgolo di tla hwetšagala phatlalatša di kgothaletša go tšweletša mekgwa e mefsa le tlhodišano ya kgwebo e matla go theknolotši ya mantšu e thekgilwego ke motšhene. Dathasete ya maleme a mantši ya Common Voice e šetše e le e kgolo kudu go fetišiša e hwetšagalago phatlalatša ya mehuta ya yona, eupša ga se yona feela. Lebelela letlakaleng e le dišupišo bakeng sa mothopo o bulegilego wa dathasete ya lentšu, gomme ge Common Voice e tšwela pela, legae la mphsafatšo tša rena tša tokololo.

source: Website Localization
nso: Wepesaete ya Lefelong
